DEFINE DATA
LOCAL USING CUSTLDA
PARAMETER USING PDAPARM
GLOBAL USING GDAGLOB
END-DEFINE

MOVE 42 TO #CUST-ID
IF #CUST-ID > 0
  SELECT *
    FROM EMPLOYEE
    WHERE EMP_ID = #CUST-ID
  END-SELECT
END-IF
END
