PROGRAM SQLDDM

DEFINE DATA
  LOCAL
    1 EMP-ID (N8)
    1 EMP-NAME (A50)
    1 SALARY (P9.2)
  END
END-DEFINE

* Adabas READ access

READ EMPLOYEE
  MOVE EMP-NAME TO EMP-NAME
  MOVE SALARY TO SALARY
END-READ
SELECT *
  FROM EMPLOYEE
  WHERE EMP_ID = EMP-ID
END-SELECT

END
