PROGRAM SQLHOST

DEFINE DATA
  LOCAL
    1 HOST-NAME (A50)
    1 HOST-SALARY (N9.2)
    1 PERS-ID (N8)
    1 START-DATE (D)
  END
END-DEFINE
* Native SQL
SELECT EMP_NAME, EMP_SALARY
  FROM EMPLOYEE
  WHERE EMP_ID = PERS-ID
    AND HIRE_DATE >= :START-DATE
  CALLNAT 'PROCESS'
END-SELECT
SELECT EMP_NAME, EMP_SALARY
  INTO HOST-NAME, HOST-SALARY
  FROM EMPLOYEE
  WHERE EMP_ID = PERS-ID
    AND HIRE_DATE >= :START-DATE
  CALLNAT 'PROCESS'
END-SELECT

* PROCESS SQL with host vars
PROCESS SQL EMPLOYEE-DATA
  << SELECT EMP_ID, EMP_NAME FROM EMP_TABLE
     WHERE EMP_ID = :PERS-ID
       AND SALARY > :START-DATE >>
END

END
