* Program to test same-file variable navigation (feature 27, T3).
* DEFINE DATA with scalar, group, subfield, REDEFINE, array fields.
* Variable uses across MOVE, IF, WRITE, COMPUTE, CALLNAT arguments.

PROGRAM VARTEST
DEFINE DATA
  LOCAL

    1 #SCALAR-VAR (A20)
    1 #AMOUNT (N7.2)
    1 #GROUP
      2 #SUB-FIELD (A10)
      2 #COUNT (N4)
    1 #REDEFINE-FIELD REDEFINE #GROUP
      2 #REDEF-PART-A (A6)
      2 #REDEF-PART-B (A4)
    1 #ARRAY-FIELD (A5/1:5)
    1 #INDEX (I2)
    1 #SYS-VAR (A20)
  END
END-DEFINE
WRITE #SCALAR-VAR
MOVE 'HELLO' TO #SCALAR-VAR
MOVE #AMOUNT TO #OTHER-VAR
IF #SCALAR-VAR = 'TEST'
  WRITE #SCALAR-VAR
END
MOVE #GROUP.#SUB-FIELD TO #ARRAY-FIELD (#INDEX)
MOVE #REDEF-PART-A TO #SUB-FIELD
PERFORM HELPER USING #SCALAR-VAR #GROUP.#COUNT

MOVE *DATE TO #SYS-VAR
* #SCALAR-VAR in a comment
MOVE 'VALUE: #SCALAR-VAR' TO #SCALAR-VAR

SUBROUTINE HELPER
  DEFINE SUBROUTINE DATA
    1 #LOCAL-PARAM (A10)
    1 #LOCAL-PARAM-NUM (N3)
  END
END

END
