* FETCH static and dynamic calls, no library qualifier on FETCH
DEFINE DATA LOCAL
  1 DESTINATION (A8)
  1 #DYNRPT (A8)
END-DEFINE

FETCH 'RPT001'

MOVE 'REPORT002' TO DESTINATION

FETCH #DYNRPT

MOVE 'BATCHJOB' TO DESTINATION

RUN 'BATCHJOB'

END
