DEFINE DATA
LOCAL
  1 #DYN (A10)
END-DEFINE

CALLNAT 'SUBPROG' PARM1 PARM2
PERFORM MY-ROUTINE
DEFINE SUBROUTINE MY-ROUTINE
  CALLNAT #DYN
END-SUBROUTINE
