DB: 000 FILE: 200  - EMPTY-DDM                         DEFAULT SEQUENCE:
TYPE: ADABAS

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
******DDM OUTPUT TERMINATED******
