* Subprogram DUP in COMMON library
* Part of the ambiguity test: DUP exists in both APP and COMMON

DEFINE SUBROUTINE DUP
  DEFINE DATA
  LOCAL
    1 INPUT (A10)
  END DEFINE

  * This is the COMMON version
END SUBROUTINE
