DEFINE DATA
LOCAL USING CUSTLDA
END-DEFINE

MOVE 42 TO #CUST-ID.
MOVE "SMITH" TO #CUST-NAME.
IF #CUST-ID > 0
  MOVE "100 Main St" TO #CUST-ADDR.#STREET
END-IF.
