

IDENTIFY PROGRAM EMPVIEW.
DEFINE DATA LOCAL
  1 EMP-VIEW VIEW OF CUSTOMER
    2 CUSTOMER-ID
    2 BALANCE
    2 CUSTOMER-NAME (A50)
    2 REDEFINE CUSTOMER-ID
      3 CUST-NUM (N4)
      3 CUST-BRANCH (N4)
    2 NOT-A-FIELD
END-DEFINE.
WRITE 'Done'.
STOP.
