* AMBIG subprogram in library A
SUBROUTINE 'AMBIG'

DEFINE DATA
  PARAMETER
    1 PARM-IN (A10)
  LOCAL
    1 LOCAL-VAR (N5)
  END
END

DISPLAY PARM-IN ' from LIBA'

END
